#+property: header-args:python :session *emission* 
Carbon emission data in this analysis come from the Global Carbon
Project's fossil CO2 emission dataset:2022 release. The dataset is
available in Kaggle through this [[https://www.kaggle.com/datasets/thedevastator/global-fossil-co2-emissions-by-country-2002-2022/code][link]].

In this analysis, we use data for carbon emission for all countries
and try to find the list of the most aggressive carbon emitters. We
focus on the last year reported in the data which is 2021.

* Reading csv file
We first import some required packages:
#+begin_src python
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
#+end_src

#+RESULTS:

Data from a csv file is read and stored into a Pandas data frame:
#+begin_src python
  df = pd.read_csv("~/Downloads/emission/GCB2022v27_MtCO2_flat.csv")
  df.columns
#+end_src

#+RESULTS:
: Index(['Country', 'ISO 3166-1 alpha-3', 'Year', 'Total', 'Coal', 'Oil', 'Gas',
:        'Cement', 'Flaring', 'Other', 'Per Capita'],
:       dtype='object')

* Comparing per capita emission data

We first like to know the list of countries in the dataframe. The last
two items listed in the country column are International Transport and
Global and we won't counted them as country obviously.

#+begin_src python :results output
  index_max= len(df.index)-1
  list_count=[df.Country[i] for i in range(index_max) if df.Country[i]!=df.Country[i+1]]
  list_count.pop(-1)
  print("Total number of countries in the list:",len(list_count))
#+end_src

#+RESULTS:
: Total number of countries in the list: 230

With inspecting data frame, we realize there are some countries with
zero total emission in 2021:

#+begin_src python :results output
  zero_list=df[(df['Year']==2021) & (df['Total']==0)]['Country']
  print(zero_list.values)
#+end_src

#+RESULTS:

: ['Antarctica' 'Christmas Island' 'Panama Canal Zone'
:  'French Equatorial Africa' 'French West Africa' 'Kuwaiti Oil Fires'
:  'Leeward Islands' 'Pacific Islands (Palau)' 'Puerto Rico'
:  'Ryukyu Islands' 'St. Kitts-Nevis-Anguilla']

We filter these countries from our list since such countries are not
contributing to global emission. We store our list of  emission per capita
for 2021 for non-zero emitters into ~list_pc~:
#+begin_src python
  list_pc=df[(df['Year']==2021) & (df['Total']!=0) ]['Per Capita']
  list_pc=list_pc[:-2]
#+end_src

#+RESULTS:


To find the top twenty countries with the highest emission per capita:

#+begin_src python :results output
  pc_sorted=list_pc.sort_values()
  print(df.iloc[pc_sorted.index[-20:]]['Country'].values[-1::-1])
#+end_src

#+RESULTS:

: ['Qatar' 'Bahrain' 'Kuwait' 'Trinidad and Tobago' 'Brunei Darussalam'
:  'United Arab Emirates' 'New Caledonia' 'Saudi Arabia' 'Oman' 'Australia'
:  'Mongolia' 'USA' 'Sint Maarten (Dutch part)' 'Kazakhstan' 'Canada'
:  'Palau' 'Faeroe Islands' 'Turkmenistan' 'Luxembourg' 'Russia']

